nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc_demo.c
  ainfo("ADC setup complete\n");
  return OK;
}

/****************************************************************************
 * Name: ra8e1_adc_convert_voltage
 *
 * Description:
 *   Convert ADC reading to actual battery voltage in millivolts
 *
 * Input Parameters:
 *   adc_value - Raw ADC value (12-bit)
 *
 * Returned Value:
 *   Battery voltage in millivolts
 *
 ****************************************************************************/

static uint32_t ra8e1_adc_convert_voltage(uint32_t adc_value)
{
  uint32_t voltage_mv;

  /* Convert ADC value to voltage considering the voltage divider */

  voltage_mv = (adc_value * ADC_VREF_MV) / ADC_MAX_VALUE;
  voltage_mv = (uint32_t)(voltage_mv * BATTERY_VOLTAGE_DIVIDER_RATIO);

  return voltage_mv;
}

/****************************************************************************
 * Name: ra8e1_adc_convert_current
 *
 * Description:
 *   Convert ADC reading to actual battery current in milliamps
 *
 * Input Parameters:
 *   adc_value - Raw ADC value (12-bit)
 *
 * Returned Value:
 *   Battery current in milliamps (positive = charging, negative = discharging)
 *
 ****************************************************************************/

static int32_t ra8e1_adc_convert_current(uint32_t adc_value)
{
  int32_t voltage_mv;
  int32_t current_ma;
  int32_t offset_mv = ADC_VREF_MV / 2;  /* ACS712 offset (VCC/2) */

  /* Convert ADC value to voltage */

  voltage_mv = (adc_value * ADC_VREF_MV) / ADC_MAX_VALUE;

  /* Convert to current using ACS712 sensitivity (185mV/A) */

  current_ma = ((voltage_mv - offset_mv) * 1000) / CURRENT_SENSOR_SENSITIVITY;

  return current_ma;
}

/****************************************************************************
 * Name: ra8e1_calculate_battery_percentage
 *
 * Description:
 *   Calculate battery percentage based on voltage
 *
 * Input Parameters:
 *   voltage_mv - Battery voltage in millivolts
 *
 * Returned Value:
 *   Battery percentage (0-100)
 *
 ****************************************************************************/

static uint8_t ra8e1_calculate_battery_percentage(uint32_t voltage_mv)
{
  if (voltage_mv >= BATTERY_VOLTAGE_MAX)
    {
      return 100;
    }
  else if (voltage_mv <= BATTERY_VOLTAGE_MIN)
    {
      return 0;
    }
  else
    {
      /* Linear interpolation between min and max voltage */

      return (uint8_t)(((voltage_mv - BATTERY_VOLTAGE_MIN) * 100) /
                       (BATTERY_VOLTAGE_MAX - BATTERY_VOLTAGE_MIN));
    }
}

/****************************************************************************
 * Name: ra8e1_adc_read_channel
 *
 * Description:
 *   Read a single ADC channel value
 *
 * Input Parameters:
 *   channel - ADC channel number
 *   value   - Pointer to store the read value
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int ra8e1_adc_read_channel(uint8_t channel, uint32_t *value)
{
  struct adc_msg_s sample;
  ssize_t nbytes;
  int fd;
  int ret;

  /* Open ADC device */

  fd = open("/dev/adc0", O_RDONLY);
  if (fd < 0)
    {
      aerr("ERROR: Failed to open ADC device: %d\n", errno);
      return -errno;
    }

  /* Trigger ADC conversion */

  ret = ioctl(fd, ANIOC_TRIGGER, 0);
  if (ret < 0)
    {
      aerr("ERROR: Failed to trigger ADC conversion: %d\n", errno);
      close(fd);
      return -errno;
    }

  /* Read ADC sample */

  nbytes = read(fd, &sample, sizeof(sample));
  if (nbytes != sizeof(sample))
    {
      aerr("ERROR: Failed to read ADC sample: %zd\n", nbytes);
      close(fd);
      return -EIO;
    }

  /* Verify channel matches */

  if (sample.am_channel != channel)
    {
      awarn("WARNING: Expected channel %d, got %d\n", channel, sample.am_channel);
    }

  *value = sample.am_data;
  close(fd);

  return OK;
}

/****************************************************************************
 * Name: ra8e1_adc_read_battery_data
 *
 * Description:
 *   Read both voltage and current channels and update battery status
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int ra8e1_adc_read_battery_data(void)
{
  uint32_t voltage_raw, current_raw;
  int ret;

  /* Read battery voltage channel */

  ret = ra8e1_adc_read_channel(ADC_BATTERY_VOLTAGE_CHANNEL, &voltage_raw);
  if (ret < 0)
    {
      aerr("ERROR: Failed to read voltage channel: %d\n", ret);
      return ret;
    }

  /* Read battery current channel */

  ret = ra8e1_adc_read_channel(ADC_BATTERY_CURRENT_CHANNEL, &current_raw);
  if (ret < 0)
    {
      aerr("ERROR: Failed to read current channel: %d\n", ret);
      return ret;
    }

  /* Convert raw values to actual measurements */

  g_battery_status.voltage_mv = ra8e1_adc_convert_voltage(voltage_raw);
  g_battery_status.current_ma = ra8e1_adc_convert_current(current_raw);
  g_battery_status.percentage = ra8e1_calculate_battery_percentage(g_battery_status.voltage_mv);

  /* Calculate power consumption */

  g_battery_status.power_mw = (g_battery_status.voltage_mv * abs(g_battery_status.current_ma)) / 1000;

  /* Determine charging status */

  g_battery_status.is_charging = (g_battery_status.current_ma > 50);  /* > 50mA considered charging */
  g_battery_status.is_valid = true;

  ainfo("Battery Status: %lu mV, %ld mA, %lu mW, %d%%, %s\n",
        g_battery_status.voltage_mv, g_battery_status.current_ma,
        g_battery_status.power_mw, g_battery_status.percentage,
        g_battery_status.is_charging ? "Charging" : "Discharging");

  return OK;
}

#ifdef CONFIG_RA8_ADC_DTC
/****************************************************************************
 * Name: ra8e1_adc_read_batch_dtc
 *
 * Description:
 *   Read multiple ADC channels using DTC (Data Transfer Controller)
 *
 * Input Parameters:
 *   channels - Array of channel numbers to read
 *   values   - Array to store read values
 *   count    - Number of channels to read
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int ra8e1_adc_read_batch_dtc(FAR const uint8_t *channels,
                                    FAR uint32_t *values, size_t count)
{
  int fd;
  int ret;

  if (count > ADC_DTC_BUFFER_SIZE)
    {
      aerr("ERROR: Channel count %zu exceeds buffer size %d\n", count, ADC_DTC_BUFFER_SIZE);
      return -EINVAL;
    }

  /* Open ADC device */

