nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc_demo.c
          case 's':
            single_mode = true;
            break;

          case 'm':
            continuous_mode = true;
            break;

          case '?':
          default:
            fprintf(stderr, "Error: Unknown option\n");
            show_usage(argv[0], EXIT_FAILURE);
            break;
        }
    }

  /* Validate mode combinations */

  if (single_mode && continuous_mode)
    {
      fprintf(stderr, "Error: Cannot use both single and continuous mode\n");
      show_usage(argv[0], EXIT_FAILURE);
    }

  printf("FPB-RA8E1 ADC Battery Monitor\n");
  printf("=====================================\n");

  /* Initialize ADC */

  ra8e1_adc_initialize();

  if (single_mode)
    {
      /* Single sample mode */

      printf("Taking single battery measurement...\n");
      ret = ra8e1_get_battery_status(&status);
      if (ret < 0)
        {
          fprintf(stderr, "Error: Failed to read battery status: %d\n", ret);
          return EXIT_FAILURE;
        }

      print_battery_status(&status, true);  /* Always verbose for single mode */
    }
  else if (continuous_mode)
    {
      /* Continuous monitoring mode */

      printf("Continuous monitoring mode (Ctrl+C to stop)\n");
      if (!verbose)
        {
          printf("Format: Voltage | Current | Power | Charge | Status\n");
          printf("--------|--------|-------|-------|--------\n");
        }

      i = 0;
      while (true)
        {
          ret = ra8e1_get_battery_status(&status);
          if (ret < 0)
            {
              fprintf(stderr, "Error: Failed to read battery status: %d\n", ret);
              usleep(delay_ms * 1000);
              continue;
            }

          if (verbose)
            {
              printf("\n--- Sample %d ---\n", ++i);
            }
          else
            {
              printf("%3d: ", ++i);
            }

          print_battery_status(&status, verbose);

          usleep(delay_ms * 1000);
        }
    }
  else
    {
      /* Multiple sample mode */

      printf("Taking %d battery measurements with %dms delay...\n", 
             sample_count, delay_ms);

      if (!verbose)
        {
          printf("Sample | Voltage | Current | Power | Charge | Status\n");
          printf("-------|---------|---------|-------|--------|--------\n");
        }

      for (i = 0; i < sample_count; i++)
        {
          ret = ra8e1_get_battery_status(&status);
          if (ret < 0)
            {
              fprintf(stderr, "Sample %d: Failed to read battery status: %d\n", 
                      i + 1, ret);
              continue;
            }

          if (verbose)
            {
              printf("\n--- Sample %d of %d ---\n", i + 1, sample_count);
            }
          else
            {
              printf("%3d:   ", i + 1);
            }

          print_battery_status(&status, verbose);

          if (i < sample_count - 1)
            {
              usleep(delay_ms * 1000);
            }
        }
    }

  printf("\nBattery monitoring complete.\n");
  return EXIT_SUCCESS;

#else
  printf("Error: ADC battery monitoring not enabled in configuration\n");
  printf("Please enable CONFIG_RA8_ADC_BATTERY_MONITOR\n");
  return EXIT_FAILURE;
#endif
}

#endif /* CONFIG_RA8_ADC_BATTERY_MONITOR_DEMO */
